GigaDevice-GD32-MCU/GD32M53x_Demo_Suites/GD32M531R_EVAL_Demo_Suites/Utilities/gd32m53x_eval.h
/*!
    \file    gd32m53x_eval.h
    \brief   definitions for GD32M53X_EVAL's leds, keys and COM ports hardware resources

    \version 2026-03-04, V1.0.0, demo for GD32M53x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32M53X_EVAL_H
#define GD32M53X_EVAL_H

#ifdef __cplusplus
extern "C" {
#endif

#include "gd32m53x.h"
#include <stdio.h>

/* exported types */
typedef enum {
    LED1 = 0,
    LED2 = 1,
    LED3 = 2,
    LED4 = 3,
    LED_MAX
} led_typedef_enum;

typedef enum {
    KEY_WAKEUP = 0,
    KEY_USER = 1,
    KEY_MAX
} key_typedef_enum;

typedef enum {
    KEY_MODE_GPIO = 0,
    KEY_MODE_EXTI = 1
} keymode_typedef_enum;

/* eval board low layer led */
#define LEDn                             4U

#define LED1_PIN                         GPIO_PIN_9
#define LED1_GPIO_PORT                   GPIOD
#define LED1_GPIO_CLK                    RCU_GPIOD

#define LED2_PIN                         GPIO_PIN_10
#define LED2_GPIO_PORT                   GPIOD
#define LED2_GPIO_CLK                    RCU_GPIOD

#define LED3_PIN                         GPIO_PIN_11
#define LED3_GPIO_PORT                   GPIOD
#define LED3_GPIO_CLK                    RCU_GPIOD

#define LED4_PIN                         GPIO_PIN_12
#define LED4_GPIO_PORT                   GPIOD
#define LED4_GPIO_CLK                    RCU_GPIOD

#define COMn                             2U
/* COM on the board is EVAL_COM0 */
#define EVAL_COM                         EVAL_COM0

#define EVAL_COM0                        UART3
#define EVAL_COM0_CLK                    RCU_UART3
#define EVAL_COM0_TX_PIN                 GPIO_PIN_13
#define EVAL_COM0_RX_PIN                 GPIO_PIN_14
#define EVAL_COM0_GPIO_PORT              GPIOF
#define EVAL_COM0_GPIO_CLK               RCU_GPIOF
#define EVAL_COM0_AF                     GPIO_AF_7

#define EVAL_COM1                        UART2
#define EVAL_COM1_CLK                    RCU_UART2
#define EVAL_COM1_TX_PIN                 GPIO_PIN_10
#define EVAL_COM1_RX_PIN                 GPIO_PIN_9
#define EVAL_COM1_GPIO_PORT              GPIOF
#define EVAL_COM1_GPIO_CLK               RCU_GPIOF
#define EVAL_COM1_AF                     GPIO_AF_6

#define KEYn                             2U

/* wakeup push-button */
#define WAKEUP_KEY_PIN                   GPIO_PIN_0
#define WAKEUP_KEY_GPIO_PORT             GPIOA
#define WAKEUP_KEY_GPIO_CLK              RCU_GPIOA
#define WAKEUP_KEY_EXTI_LINE             EXTI_2
#define WAKEUP_KEY_EXTI_GPIO_SOURCE      EXTI_SOURCE_EXTI2_PA0
#define WAKEUP_KEY_EXTI_IRQn             EXTI2_IRQn

/* user push-button */
#define USER_KEY_PIN                     GPIO_PIN_0
#define USER_KEY_GPIO_PORT               GPIOB
#define USER_KEY_GPIO_CLK                RCU_GPIOB
#define USER_KEY_EXTI_LINE               EXTI_7
#define USER_KEY_EXTI_GPIO_SOURCE        EXTI_SOURCE_EXTI7_PB0
#define USER_KEY_EXTI_IRQn               EXTI5_9_IRQn

/* function declarations */
/* configure led GPIO */
void gd_eval_led_init(led_typedef_enum lednum);
/* turn on selected led */
void gd_eval_led_on(led_typedef_enum lednum);
/* turn off selected led */
void gd_eval_led_off(led_typedef_enum lednum);
/* toggle the selected led */
void gd_eval_led_toggle(led_typedef_enum lednum);
/* configure key */
void gd_eval_key_init(key_typedef_enum key_num, keymode_typedef_enum key_mode);
/* return the selected key state */
uint8_t gd_eval_key_state_get(key_typedef_enum key);
/* configure COM port */
void gd_eval_com_init(uint32_t com);

#ifdef __cplusplus
}
#endif

#endif /* GD32M53X_EVAL_H */
